Revit 2024 API
TilePattern.TilesPerSeedNode Property
Get the number of tiles located at each seed node.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public int TilesPerSeedNode { get; }
Visual Basic
Public ReadOnly Property TilesPerSeedNode As Integer
	Get
Visual C++
public:
property int TilesPerSeedNode {
	int get ();
}
Remarks
Currently the number of tiles per seed node is always either 1 or 2.
See Also
TilePattern Class
Autodesk.Revit.DB Namespace